In [1]:
import pandas as pd

In [2]:
data = {
    'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
    'city':['Lucknow', 'Kanpur','Kanpur','Lucknow','Lucknow','Kanpur','Kanpur','Lucknow'],
    'sales':[10, 20, 30, 40, 50, 60, 70, 80],
    'profit':[2,3,1,1,2,3,1,2]
}
df = pd.DataFrame(data)
df

   year     city  sales  profit
0  2010  Lucknow     10       2
1  2011   Kanpur     20       3
2  2012   Kanpur     30       1
3  2011  Lucknow     40       1
4  2012  Lucknow     50       2
5  2010   Kanpur     60       3
6  2011   Kanpur     70       1
7  2012  Lucknow     80       2

In [3]:
df.groupby('city')['sales'].sum()

city
Kanpur     180
Lucknow    180
Name: sales, dtype: int64

In [4]:
#df.groupby(['city','year'])['sales'].sum().reset_index()

      city  year  sales
0   Kanpur  2010     60
1   Kanpur  2011     90
2   Kanpur  2012     30
3  Lucknow  2010     10
4  Lucknow  2011     40
5  Lucknow  2012    130

In [9]:
# pivot table
df.pivot_table(index='city', columns='year', values='sales', aggfunc='sum')

year     2010  2011  2012
city
Kanpur     60    90    30
Lucknow    10    40   130